Repository: noamby/routine_flow_flutter
Catalog: lib/l10n/app_*.arb
Languages: he

# appTitle
source: Routine Flow
he: זרימת שגרה

source: Routines
he: שגרות

source: Morning Routine
he: שגרת בוקר

source: Evening Routine
he: שגרת ערב

source: Add New Routine
he: הוסף שגרה חדשה

source: Clear All Tasks
he: נקה את כל המשימות

source: Manage Household
he: נהל משק בית

source: Add New Member
he: הוסף בן משפחה

source: Add New Task
he: הוסף משימה חדשה

source: Edit Name
he: ערוך שם

# enterChildName
source: Enter family member name
he: הכנס שם בן משפחה

source: Enter member name
he: הכנס שם בן משפחה

source: Enter task text
he: הכנס טקסט משימה

source: Cancel
he: ביטול

source: Add
he: הוסף

source: Save
he: שמור

source: Close
he: סגור

source: Done
he: סיום

source: Delete
he: מחק

source: Edit
he: ערוך

# pickColor
source: Pick a color
he: בחר צבע

source: Select Icon
he: בחר אייקון

source: Select Animation
he: בחר אנימציה

source: Routine Name
he: שם השגרה

source: Add Task
he: הוסף משימה

source: Save Routine
he: שמור שגרה

source: Save Changes
he: שמור שינויים

source: Edit Routine
he: ערוך שגרה

source: Exit Child Mode
he: צא ממצב ילדים

source: Enter Child Mode
he: היכנס למצב ילדים

# pleaseEnterNumber
source: Please enter the number {number}
he: אנא הכנס את המספר {number}

source: Enter number
he: הכנס מספר

# incorrectNumber
source: Incorrect number. Please try again.
he: מספר שגוי. אנא נסה שוב.

source: No Recent Emojis
he: אין אימוג'י אחרונים

# tasksSlideInFromRight
source: Tasks slide in from the right
he: המשימות נכנסות מימין

source: Tasks fade in smoothly
he: המשימות מופיעות בעדינות

source: Tasks scale up from nothing
he: המשימות גדלות מאפס

# tasksBounceInFromBottom
source: Tasks bounce in from the bottom
he: המשימות קופצות מלמטה

source: Tasks rotate in
he: המשימות מסתובבות פנימה

source: 🌅 Wake up
he: 🌅 התעורר

source: 🦷 Brush teeth
he: 🦷 צחצח שיניים

source: 👕 Get dressed
he: 👕 התלבש

source: 🍳 Eat breakfast
he: 🍳 אכל ארוחת בוקר

source: 🎒 Pack bag
he: 🎒 ארוז תיק

source: 🛁 Take a bath
he: 🛁 התרחץ

source: 📚 Read a book
he: 📚 קרא ספר

source: 😴 Go to sleep
he: 😴 לך לישון

source: Language
he: שפה

# addTaskTooltip
source: Add a new task
he: הוסף משימה חדשה

# editColorTooltip
source: Edit member color
he: ערוך צבע בן משפחה

# editNameTooltip
source: Edit member name
he: ערוך שם בן משפחה

# tasksSuffix
source: 's Tasks
he: - משימות

# languageChanged
source: Language changed successfully
he: השפה שונתה בהצלחה

source: Updating interface...
he: מעדכן ממשק...

# routineUpdated
source: Routine updated successfully
he: השגרה עודכנה בהצלחה

source: Default routine name cannot be changed
he: שם שגרת ברירת המחדל לא ניתן לשינוי

source: Light Mode
he: מצב בהיר

source: Dark Mode
he: מצב כהה

source: Toggle Theme
he: החלף ערכת נושא

source: Add your family members
he: הוסף את בני המשפחה שלך

source: Family Members
he: בני משפחה

source: No family members added yet
he: עדיין לא נוספו בני משפחה

# addFamilyMembersAboveOrSkip
source: Add family members above or skip to use defaults
he: הוסף בני משפחה למעלה או דלג כדי להשתמש בברירת המחדל

# skipAndUseDefaults
source: Skip & Use Defaults
he: דלג והשתמש בברירת מחדל

# continueButton
source: Continue
he: המשך

source: Skip
he: דלג

source: Next
he: הבא

source: Previous
he: הקודם

source: Get Started
he: התחל

source: Welcome to Routine Flow
he: ברוכים הבאים לזרימת שגרה

# welcomeDescription
source: Organize your family's daily routines with ease. Create personalized task lists for each family member.
he: ארגן את השגרות היומיות של המשפחה שלך בקלות. צור רשימות משימות מותאמות אישית לכל בן משפחה.

source: Morning & Evening Routines
he: שגרות בוקר וערב

# morningEveningDescription
source: Start with built-in routines or create your own. Each routine has customizable tasks and animations.
he: התחל עם שגרות מובנות או צור משלך. לכל שגרה יש משימות ואנימציות הניתנות להתאמה אישית.

# familyMembersTitle
source: Family Members
he: בני משפחה

# familyMembersDescription
source: Add tasks for each family member. Each person gets their own column with personalized colors.
he: הוסף משימות לכל בן משפחה. כל אדם מקבל עמודה משלו עם צבעים מותאמים אישית.

source: Track Progress
he: עקוב אחר התקדמות

# trackProgressDescription
source: Check off completed tasks. Finished tasks move to the bottom automatically.
he: סמן משימות שהושלמו. משימות שהסתיימו עוברות לתחתית באופן אוטומטי.

source: Child Mode
he: מצב ילדים

# childModeDescription
source: Enable child mode for a safe, simplified interface. Kids can check off tasks without editing.
he: הפעל מצב ילדים לממשק בטוח ופשוט. ילדים יכולים לסמן משימות בלי לערוך.
